ad_div = u'''
        <div>
			<img src="http://www.anzhi.com/icon.php?u=dGh1bWJ8MjAxMjA3fDI0fG9kQnFBVFo0RlZHWnN0MXpVZ2dzeldUN3Y0RElNN3BUN1E2dzllenRvaDU4aEJnclZ0ND0="></img>
			<img src="http://www.anzhi.com/icon.php?u=dGh1bWJ8MjAxMjA3fDI0fG9kQnFBVFo0RlZHWnN0MXpVZ2dzeldUN3Y0RElNN3BTNlFpMitlVHRvaDU5aEJnclZ0ND0="></img>
		</div>
		<div>
			<p>下载地址:<p>
			<a href="http://nighteyes.sinaapp.com/wheel/takeoff_download" target="_blank">
				http://nighteyes.sinaapp.com/wheel/takeoff_download
			</a>
			<p>官方网站(知名安卓市场):<p>
			<a href="http://nighteyes.sinaapp.com/wheel/takeoff" target="_blank">
				http://nighteyes.sinaapp.com/wheel/takeoff
			</a>
		</div>
		<div>
			<p>二维码下载:</p>
			<img src="http://nf.anzhi.com/QRcode.php?url=http%3A%2F%2Fwww.anzhi.com%2Fdl_app.php%3Fs%3D1307285&time=1389628800&key=11ebf7fe8ec0adf5f9f22a1ac0a77492">
		</div>
		<div>
			<p>玩儿法：</p>
			<p>
				画面上会有一个不断旋转的轮盘,用户点击屏幕便会暂停在指定选项上,游戏里的美女便会根据轮盘选项做出服饰变更.有难度,有耐心才会有惊喜哦
			</p>
		</div>
    '''

mix_up_text = u'''
第一章 永远记得我 

    我今年三十七岁。现在，我正坐在波音七四七的机舱里。这架硕大无比的飞机正穿过厚厚的乌云层往下俯冲，准备降落在汉堡机场。十一月冷冽的雨湮得大地一片雾蒙蒙的。穿着雨衣的整修工、整齐划一的机场大厦上竖着的旗、BMW的大型广告牌，这一切的一切看来都像是法兰德斯派画里阴郁的背景。唉！又来到德国了。 

　　这时，飞机顺利着地，禁菸灯号也跟着熄灭，天花板上的扩音器中轻轻地流出BGM音乐来。正是披头四的“挪威的森林”，倒不知是由哪个乐团演奏的。一如往昔，这旋律仍旧撩动着我的情绪。不！远比过去更激烈地撩动着我、摇撼着我。 

　　为了不叫头脑为之迸裂，我弓着身子，两手掩面，就这么一动不动。不久，一位德籍的空中小姐走了过来，用英文问我是不是不舒服，我答说不打紧，只是有点头晕而已。 

　　“真的不要紧吗？” 

　　“不要紧，谢谢你！”我说道。于是她带着微笑离开，这时，扩音器又放出比利乔的曲子。抬起头，我仰望飘浮在北海上空的乌云，一边思索着过去的大半辈子里，自己曾经失落了的。思索那些失落了的岁月，死去或离开了的人们，以及烟消云散了的思念。 

　　在飞机完全静止下来，人们纷纷解开安全带，开始从柜子里取出手提包、外套时，我始终是待在那片草原上的。我嗅着草香、聆听鸟鸣，用肌肤感受着风。那是在一九六九年秋天，我就要满二十岁的时候。 

　　刚刚那位空中小姐又走了过来，在我身旁坐了下来，开口问我要不要紧。 

　　“不要紧！谢谢。我只是觉得有些感伤而已。（lt's all right now.thank you.I only felt lonely，you know.）”我笑着答道。 

　　“Well，I fell same way，same things，once in a while.I know what you mean. （我也常常这样子哩！我能理解！）”说罢，她摇摇头，从座位上站起来，对着我展开一副美丽的笑容。“I hope you'll have an ice trip. AufWiedersehen！（祝您旅途愉快。再见！）” 

　　“AufWiedersehen！”我也跟着说道。 

　　就算在十八年后的今天，那片草原风光也仍旧历历在目。绵延数日的霏霏细雨冲走了山间光秃秃的地表上堆积的尘土，漾出一股深邃的湛蓝，而十月的风则撩得芒草左右摇曳，窄窄长长的云又冻僵了似的紧偎着蔚蓝的天空。天空高踞顶上，只消定睛凝视一会，你便会感到两眼发痛。风吹过草原，轻拂着她的发，然后往杂树林那头遁去。树叶沙沙作响，远处几声狗吠。那声音听来有些模糊，彷佛你正立在另一个世界的入口一般。除此以外，再没有别的声响。不管是什么声响都无法进入我们的耳里。再没有人会和我们错身而过，只看到两只鲜红的鸟怯生生地从草原上振翅飞起，飞进杂树林里。一边踱着步，直子便一边跟我聊起那口井来了。 

　　记忆这玩意儿真是不可思议。当我身历其境时，我是一点儿也不去留意那风景。当时我并不觉得它会让人留下深刻的印象，也绝没料到在十八年后，我可能将那一草一木记得这么清楚。老实说，那时候的我根本不在意什么风景。我只关心我自己，关心走在我身旁的这个美人，关心我和她之间的关系，然后再回头来关心自己。不管见到什么、感受到什么、想到什么，结果总会像飞镖一样，又飞到自己这一边来，当时正是这样一个时代。再说，我那时又在谈恋爱，那场恋爱谈得也着实辛苦。我根本就没有气力再去留意周遭的风景。 

　　然而，现在率先浮现在我的脑海里的，却是那一片草原风光。草香、挟着些微寒意的风、山的线、狗吠声，率先浮现的正是这些，清清楚楚地。也因为实在太清楚了，让人觉得彷佛只要一伸手，便能用手指将它们一一描绘出来。但草原上不见人影。一个人也没有。没有直子，也没有我。我不知道我们究竟上哪儿去了。为什么会突然发生这种事呢？曾经那么在意的，还看她、我、我的世界，究竟都上哪儿去了？对了，我现在甚至无法立即记忆起直子的脸来，我能想到的，就是一幕不见人影的背景而已。 

　　当然，只要肯花时间我还是可以忆起她的脸。小小的冰冷的手、一头触感柔顺光滑的长发、软而圆的耳垂、耳垂下方一颗小小的痣、冬天里常穿的那件骆驼牌外套、老爱凝视对方的双眼发问的怪癖、有事没事便发颤的嗓音（就像是站在刮着强风的山坡上说话一样），把这些印象统统集合起来的话，她的脸便自然而然地显现出来了。最先显现出的是她的侧脸。这大约是因为我和直子总是并肩走在一块的关系罢。所以先让我忆起的常是她的侧脸。然后，她会转向我这边，轻轻地笑着，微微地歪着头开始说话，一边凝视着我的眼睛。彷佛要在清澈的泉底寻找一晃而过的小鱼似的。 

　　不过，我得花上一段时间才能如此这般地忆起直子的脸。而且，随着岁月的消逝，时间花得愈来愈长，尽管很叫人感到悲哀，但却是千真万确。最初只要五秒钟我便能想起来的，渐渐地变成十秒、三十秒，然后是一分钟。就像是黄昏时的黑影，愈拉愈长。最后大概就会被黑暗给吞噬了罢？是的，我的记忆确实是和直子离得愈来愈远了，正如我和过去的我离得愈来愈远一般。只有那风景、那十月的草原风景，就像电影里象徵的画面，不断地在我脑海中浮现。那风景执拗地“踢”着我脑中的某一个部分。喂！起来吧！我还在这儿哩！起来吧！起来了解一下我为什么还在这儿的理由吧！不痛！一点儿都不痛！只是每一脚便会有回音。但恐怕过不了多久回音也会消失吧？正如所有一切已然消失了一般。然而，在这汉堡机场的路福特汉札（Lufthansa航空公司名）的飞机里，它们比往常更长时间地、更强烈地打着我的头。起来吧！起来了解吧！所以，我才写了这篇小说。因为我是那种一旦有什么事，不把它写成文字的话，便无法清楚地理解它的人。 

　　那时候，她究竟都聊了些什么？ 

　　对了，她聊起一口野井。我不知道是否真的有那一口井，或许那只是存在她脑海中的一个形象的记号而已——如同那段晦暗的日子里，她在脑海中编织出的许多事物一般。然而，自从直子提过之后，我每想起草原的风景，便会跟着想起那口井来。我虽不曾亲眼目睹过，但在我脑中它却和那片风景紧密地烙在一块儿，是不可分割的。我甚至能够详细地描出那口井的模样。它就位在草原和杂树林之间。蔓草巧妙地遮住了这个在地表上横开约直径一公尺的黑洞。四周围既没有栅栏，也没有高出的石摒。只有这个洞大大地张着口。井缘的石头经过风吹雨打，变成一种奇特的白浊色，而且到处都是割裂崩塌的痕迹。只见小小的绿蜥蜴在石头的缝隙里飞快地续进续出。横过身子去窥探那洞，你却看不到什么。我只知道它反正是又恐怖又深邃，深到你无法想像的地步。而其中却只充塞着黑暗——混杂了这世界所有黑暗的一种浓稠的黑暗。 

　　“是真的——真的很深唷！”直子谨慎地措词。她说话常常是那种方式。一面谨慎地选词，一面慢慢地说。“真的很深。不过，没有人知道它的位置。但它一定是在这一带的某个地方。” 

　　说罢，她将双手插进斜纹软呢上衣的口袋里，微笑地看着我，一副认真的表倩。 

　　“那不是太危险了？”我说道。“在某个地方有一口深井，没有人知道它在哪儿。万一掉进去不就完了？” 

　　“是呀！咻——砰！然后一切结束！” 

　　“会不会真有这种事呀？” 
'''

body_div_list = [ad_div]


def initialize():
    global body_div_list
    global mix_up_text
    global ad_div
    count = len(mix_up_text)
    div_count = 15
    seg_size = count/div_count
    seg_list = [ad_div]
    for i in range(0,div_count):
        start = seg_size*i
        if i == div_count-1:
            this_div = mix_up_text[start:]
        else:
            end = seg_size*(i+1)
            this_div = mix_up_text[start:end]
        this_div = u'<div style="display:none">%s</div>' % this_div
        body_div_list.append(this_div)


if __name__ == "__main__":
    initialize()
    for item in body_div_list:
        print item
    raw_input("press")